Управление_торговлей_демо_Обновл.ПроВЦ_ОрганизацияРабочегоМестаКладовщик/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РеализацияТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ПроВЦ_СтатусЗаказа</name>
    <type>
      <types>EnumRef.ПроВЦ_СтатусРеализацииПоЗаказу</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроВЦ_КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроВЦ_КоличествоПакетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроВЦ_КомментарийКладовщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>350</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласован</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.СтатусыРеализацийТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
</mdclass:Document>

Управление_торговлей_демо_Обновл.ПроВЦ_ОрганизацияРабочегоМестаКладовщик/src/Enums/ПроВЦ_СтатусРеализацииПоЗаказу/ПроВЦ_СтатусРеализацииПоЗаказу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПроВЦ_СтатусРеализацииПоЗаказу</name>
  <comment>Статус заказа - &quot;К сбору, Собран, Отгружен&quot;</comment>
  <enumValues>
    <name>КСбору</name>
  </enumValues>
  <enumValues>
    <name>Собран</name>
  </enumValues>
  <enumValues>
    <name>Откружен</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей_демо_Обновл.ПроВЦ_ОрганизацияРабочегоМестаКладовщик/src/Documents/РеализацияТоваровУслуг/Forms/ПроВЦ_ФормаКладовщика/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДокументРеализация = Параметры.ДокументРеализация;
	ПроВЦ_СтатусЗаказа = ПредопределенноеЗначение("Перечисление.ПроВЦ_СтатусРеализацииПоЗаказу.Собран");
	ПроВЦ_КоличествоКоробок = Параметры.ДокументРеализация.ПроВЦ_КоличествоКоробок;
	ПроВЦ_КоличествоПакетов = Параметры.ДокументРеализация.ПроВЦ_КоличествоПакетов;
	ПроВЦ_КомментарийКладовщика = Параметры.ДокументРеализация.ПроВЦ_КомментарийКладовщика;
КонецПроцедуры

&НаКлиенте
Процедура Собран(Команда)
	ИзменитьДокумент();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ИзменитьДокумент()
	ОбъектДок = ДокументРеализация.ПолучитьОбъект();
	ЗаполнитьЗначенияСвойств(ОбъектДок,ЭтотОбъект);
	ОбъектДок.Записать();
КонецПроцедуры


&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
